1. 'number' + 3 + 3

оскільки 'number' це строка , то йде перетворення числа на строку і по ітогу резултат ('number33')

2. null + 3

null перетворюється на число , null = 0 , 0+3 = 3 результат (3)

3. 5 && "qwerty"

&& оператор шкуає перше falsy значення , або повертає останій операнд . Результат ("qwerty")

4. +'40' + +'2' + "hillel";

унарний + перетворю 40 на число , а + перетворю 2 на число , тому результат :"42hillel"

5. '10' - 5 === 6;

оператор - перетворює рядок '10'  на число, 10-5 = 5 , 5===6 , значення різни , тому результат (false)

6. true + false

true і false мають тип boolean , тобто true 1, false 0 , 1+0 = 1 . Результат (1)

7. '4px' - 3

'4px' оператор - не зможе перетворити повністью на число , тому буде NaN -3. Результат NaN

8. '4' - 3

оператор - перетворює рядок '4' на число 4 , 4-3 =1 . Результат 1

9. '6' + 3 ** 0;

спочатку виконається рівняння 3 ** 0 , а 3 устепені 0 це 1. а '6' це строка , тобто 1 перетврюється теж на рядок '1' ,
    '6'+'1' = '61'

10. 12 / '6'

оператор / перетворює строку '6' на число 6. 12/6 = 2 . Результат 2

11. '10' + (5 === 6);

перше виконується те що в лапках і ми отримуємо false , так як '10' це строка , то false перетворюється в рядок і буде
'10'+'false' = '10false'

12. null == '' , так як тут не строге порівння то ми отримуємо false . Так як null =  undefined , порожня строка не є
(undefined)

13. 3 ** (9 / 3);

перше в нас тут ділення , а потім 3 в 3 степені в нас 27. Результат 27

14. !!'false' == !!'true'

!! перетворює обидві строки на true , і результат порівння (true)

15. 0 || '0' && 1

&& має вищий пріорітет , тобто 0 || ('0' && 1) , повертає 1 , далі 0 || 1 і знову повертає 1 . Результат 1

16. (+null == false) < 1;

(+null == false) < 1  +null перетворює null на число 0
(0 == false) < 1  при нестрогому порівнянні false перетворюється на 0
(0 == 0) < 1  0 == 0 повертає true
true < 1  true перетворюється на 1
1 < 1
false

Резульат false

17. false && true || true

false && true дає нам false , false || true = true , так як || шукає перше true значення . Результат true

18. false && (false || true);

false && (false || true); тут пріоритет тому що в дужках , тобто ми отримуємо true , false && true =. false.
    результат false

19. (+null == false) < 1 ** 5;

(+null == false) < 1 ** 5; , перше те що в дужках , + перетворює null на 0 , 0 ==  false перетворюється на 0==0
повертає true , true перетворюється на 1 . 1 ** 5 дорівнює 1 , 1 < 1 отримуємо false